app/views/lists/show.html.erb

  <ul class="tasks">
    <% @list.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks".list_id = 1)

    <!-- I do not know how to fix this association -->
    <% @list.collaborations.each do |collaboration| %>
---
SELECT "collaborations".* FROM "collaborations" WHERE ("collaborations".list_id = 6)

  <%= form_for [@list, @collaboration] do |f| %>
    <%= select "collaboration", "user_id", User.all.collect {|u| [ u.name, u.id ] } %> <%= f.submit "Add" %>
---
SELECT "users".* FROM "users" WHERE ("users".collaboration_id = NULL) LIMIT 1