app/controllers/collaborations_controller.rb

INSERT INTO "collaborations" ("updated_at", "user_id", "list_id", "created_at") VALUES ('2011-11-02 08:21:42.690076', NULL, 6, '2011-11-02 08:21:42.690076')
---
  def create
    @collaboration = @list.collaborations.new(params[:collaboration])
    if @collaboration.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = 6 LIMIT 1
---
  def find_list
    @list = List.find(params[:list_id])