app/controllers/cron_controller.rb

  def index
    @users = User.find(:all)
    @users.each do |user|
      @due_today = []
      user.lists.each do |list|
        list.tasks.due_today.each do |task|
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "users".* FROM "users"
SELECT "lists".* FROM "lists" WHERE ("lists".user_id = 1) LIMIT 1
SELECT "tasks".* FROM "tasks" INNER JOIN "lists" ON "tasks".list_id = "lists".id WHERE (("lists".user_id = 1))