app/controllers/lists_controller.rb

  def create
    @list = List.new(params[:list])
    @list.user_id = user.id
    if @list.save
---
INSERT INTO "lists" ("user_id", "created_at", "name", "updated_at") VALUES (633107804, '2011-11-02 01:45:31.000000', 'Shopping', '2011-11-02 01:45:31.000000')

  def update
    if @list.update_attributes(params[:list])
---
UPDATE "lists" SET "updated_at" = '2011-10-22 07:42:16.369464', "name" = 'Test3' WHERE "lists"."id" = 1

  def find_lists
    @lists = List.find(:all, :conditions => ["user_id = ?", user.id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 'user_id' LIMIT 1