app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("due", "name", "list_id", "complete", "created_at", "updated_at") VALUES (NULL, 'woo, we have some tasks!', 1, NULL, '2011-10-22 11:20:55.033817', '2011-10-22 11:20:55.033817')
---
  def create
    @task = @list.tasks.new(params[:task])
    if @task.save

UPDATE "tasks" SET "name" = 'Due today 11', "updated_at" = '2011-10-26 02:07:46.513385' WHERE "tasks"."id" = 28
---
  def update
    if @task.update_attributes(params[:task])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 AND ("tasks".list_id = 1) LIMIT 1
UPDATE "tasks" SET "updated_at" = '2011-10-22 14:12:17.033123', "complete" = 't' WHERE "tasks"."id" = 1
---
  def complete
    @task = @list.tasks.find(params[:id])
    @task.complete = params[:complete]
    if(@task.save)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = 5 LIMIT 1
---
  def find_list
    @list = List.find(params[:list_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 28 LIMIT 1
---
  def find_task
    @task = Task.find(params[:id])