app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "password_salt", "username", "email", "created_at", "password_hash", "name") VALUES ('2011-10-26 01:05:25.982381', '$2a$10$lLQAgvsUyady2E6.UvcQl.', 'ben.a.currie2', 'ben.a.currie2@gmail.com', '2011-10-26 01:05:25.982381', '$2a$10$lLQAgvsUyady2E6.UvcQl.OuN5R6h6TzR0c29X97D8khiA4mttyki', 'Ben Currie 2')